{
  "About Me": "My name is Marcelo, I am a FullStack developer and entrepreneur.\nI have been involved with programming since I was 15 years old, that is, 6 years as an enthusiast and 3 years as a professional in the field.\nMy native language is Portuguese (Brazil), I also speak English, Spanish, and I am learning Russian. Привет, мир!\nI decided to create this website to compile my professional portfolios, personal projects, and also to talk a little about myself.\nAlthough my focus is on programming and coding, I also like to improve other important skills, such as secure communication and effective feedback. I also have skills in other areas: Video Editing and Creation, E-Commerce, Marketing, Practical Teaching, among others.\nI am open to proposals.",
  "portfolioResumes": {
    "Drag & Drop Panel": "An editing panel for e-commerce store templates, where it is possible to select, move, delete, and drag new sections.\nText values, colors, and font styles, such as size and type, are also editable.\nColors and styles of previously created elements are also editable.\nIt is worth mentioning that this panel, in addition to allowing an infinite number of pre-created template designs, also allows the creation of new themes and templates as it is dynamically generated based on both editable HTML and CSS code by a developer and a configuration preferences JSON.",
    "Micro-Frontend For Templates Theme": "In this project, various components were created that together form a template for an online store that can be used to create themed stores.\nEach of these components can be edited, removed, or added in each of the templates, thus generating an infinite number of possibilities for a merchant or several.\nThis project aims to facilitate the editing of a template both for a DEV and the editing of a theme (a customized template) for an end customer (layperson) through the Drag&Drop Editor.",
    "Webstore Control Panel": "This panel is not just an interface and a HUD created in ReactJS.\nIt is also a primary library for CTA elements and information input.\nThe library is created exclusively for the Webstore, where each element is editable individually or by group.",
    "Crawler Panel": "The Webstore Crawler aims to capture products from online stores across the internet, primarily from stores that use the Google dataLayer to integrate with Google MarketPlace.\nThe Crawler has an interface made in Electron.js and communicates with an internal API that uses the Puppeteer library to scrape (data search) all the products of the store in question, based on the chosen template.",
    "Business Page": "Visual reports and charts page based on sales data.\nThe interesting aspect of this project is the ability to filter the visible data by date presets (1 week ago, 1 day ago, 1 month ago, etc.) or choose a custom time range.",
    "3D Bin Packing": "Node.js project used for freight calculation.\nCompartments and items are defined as parameters for a 3D visualization function.\nThe purpose of this API is to select the smallest possible compartment for a set of items, taking into account the sum of volumes and possible angles for the set.\nFor example: A 110cm long board, despite being longer than a 100cm box, would fit inside it if positioned diagonally.",
    "RestAPI For Images Donwload and Treat": "API used to retrieve any type of image via link, process it in various ways, and generate a final optimized version of the photo along with its respective thumbnail.",
    "Americanas MarketPlace Integration": "System integration between the Webstore and the Americanas Marketplace.",
    "Omie Erp Integration": "System integration between the Webstore and the Omie Erp.",
    "Mercado Livre MarketPlace Integration": "System integration between the Webstore and the Mercado Livre Marketplace.",
    "NetShoes MarketPlace Integration": "System integration between the Webstore and the NetShoes Marketplace.",
    "Carrefour MarketPlace Integration": "System integration between the Webstore and the Carrefour Marketplace.",
    "Dafiti MarketPlace Integration": "System integration between the Webstore and the Dafiti Marketplace.",
    "Magalu MarketPlace Integration": "System integration between the Webstore and the Magalu Marketplace."
  }
}