{
  "About Me": "Me llamo Marcelo, soy un FullStack Developer y emprendedor.\nEstoy involucrado con la programación desde los 15 años, es decir, 6 años como entusiasta y 3 años como profesional en el área.\nMi idioma nativo es portugués (Brasil), también hablo inglés, español y estoy aprendiendo ruso. Привет, мир!\nDecidí crear este sitio para compilar mis portafolios profesionales, proyectos personales y también hablar un poco sobre mí.\nAunque mi enfoque principal es la programación y el código, también me gusta mejorar otras habilidades importantes, como la comunicación segura y la retroalimentación efectiva. También tengo habilidades en otras áreas: creación y edición de videos, comercio electrónico, marketing, enseñanza práctica, entre otras.\nEstoy abierto a propuestas.",
  "portfolioResumes": {
    "Drag & Drop Panel": "Un panel de edición de plantillas para tiendas virtuales, donde es posible seleccionar, mover, eliminar y arrastrar nuevas secciones.\nTambién son editables los valores de texto, colores y estilos de fuente, como el tamaño y el tipo.\nTambién son editables los colores y estilos de elementos previamente creados.\nVale mencionar que este panel, además de permitir una infinidad de creaciones de plantillas precreadas, también permite la creación de nuevos temas y plantillas, ya que se genera dinámicamente basado tanto en código HTML y CSS editable por un desarrollador como en un JSON de configuración de preferencias.",
    "Micro-Frontend For Templates Theme": "En este proyecto, se crearon varios componentes que juntos forman una plantilla para una tienda en línea que se puede usar para crear tiendas temáticas.\nCada uno de estos componentes se puede editar, eliminar o agregar en cada una de las plantillas, generando así una infinidad de posibilidades para un comerciante o varios.\nEste proyecto tiene como objetivo facilitar la edición de una plantilla tanto para un desarrollador (DEV) como la edición de un tema (una plantilla personalizada) para un cliente final (profano) a través del Editor Drag&Drop.",
    "Webstore Control Panel": "Este panel no es solo una interfaz y un HUD creado en ReactJS.\nTambién es una biblioteca primaria para elementos de CTA e ingreso de información.\nLa biblioteca está creada exclusivamente para la Webstore, donde cada elemento es editable individualmente o por grupo.",
    "Crawler Panel": "El Crawler de Webstore tiene el propósito de capturar productos de tiendas virtuales por internet, principalmente en tiendas que usan el dataLayer de Google para integrarse con Google MarketPlace.\nEl Crawler tiene una interfaz hecha en Electron.js y se comunica con una API interna que utiliza la biblioteca de Puppeteer para hacer el scrapping (búsqueda de datos) de todos los productos de la tienda en cuestión, basándose en la plantilla elegida.",
    "Business Page": "Página de informes visuales y gráficos basada en datos de ventas.\nLo interesante de este proyecto es la posibilidad de filtrar los datos visibles por preajustes de fechas (hace 1 semana, hace 1 día, hace 1 mes, etc.) o elegir un rango de tiempo personalizado.",
    "3D Bin Packing": "Proyecto en Node.js utilizado en el cálculo de fletes.\nSe definen compartimentos y artículos como parámetros para una función de visualización 3D.\nEl propósito de esta API es seleccionar el compartimento más pequeño posible para un conjunto de artículos, teniendo en cuenta la suma de volúmenes y los ángulos posibles para el conjunto.\nPor ejemplo: Una tabla de 110cm de largo, a pesar de ser más larga que una caja de 100cm, cabría en ella si se coloca en diagonal.",
    "RestAPI For Images Donwload and Treat": "API utilizada para recuperar cualquier tipo de imagen a través de un enlace, procesarla de varias maneras y generar una versión final optimizada de la foto junto con su miniatura respectiva.",
    "Americanas MarketPlace Integration": "Integración de sistema entre la Webstore y el Marketplace de Americanas.",
    "Omie Erp Integration": "Integración de sistema entre la Webstore y el Erp de Omie.",
    "Mercado Livre MarketPlace Integration": "Integración de sistema entre la Webstore y el Marketplace de Mercado Livre.",
    "NetShoes MarketPlace Integration": "Integración de sistema entre la Webstore y el Marketplace de NetShoes.",
    "Carrefour MarketPlace Integration": "Integración de sistema entre la Webstore y el Marketplace de Carrefour.",
    "Dafiti MarketPlace Integration": "Integración de sistema entre la Webstore y el Marketplace de Dafiti.",
    "Magalu MarketPlace Integration": "Integración de sistema entre la Webstore y el Marketplace de Magalu."
  }
}