{
  "About Me": "Meu nome é Marcelo, sou desenvolvedor FullStack e empreendedor.\nEu estou envolvido com programação desde os 15 anos, isto é, 6 anos como entusiasta e 3 anos como profissional na área.\nMeu idioma nativo é Português (Brasil), sei falar também Inglês, Espanhol e estou aprendendo Russo. Привет, мир!\nDecidi criar este site para compilar meus portfólios profissionais, projetos pessoais e também falar um pouco sobre mim.\nApesar do meu foco ser em programação e código, gosto de aprimorar também outras skills importantes, como por exemplo, comunicação segura e feedbacks efetivos. Tenho também skills em outras áreas: -Criação e edição de vídeo, E-Commerce, Marketing, Ensino prático, dentre outras.\nEstou aberto a propostas.",
  "portfolioResumes": {
    "Drag & Drop Panel": "Um painel de edição de templates para lojas virtuais, onde é possível selecionar, mover, deletar e arrastar novas seções.\nTambém são editáveis valores de texto, cores e estilos de fonte, tal como tamanho e tipo. São editáveis também cores e estilos de elementos previamente criados.\nVale mencionar que este painel além possibilitar uma infinidade de criações de templates pré-criados, também possibilita a criação de novos temas e templates tendo em vista que ele é gerado dinamicamente baseado tanto em código HTML e CSS que pode ser editado por um desenvolvedor como um JSON de configuração de preferências.",
    "Micro-Frontend For Templates Theme": "Neste projeto foram criados vários componentes que juntos formam um template para loja virtual que podem ser usados para a criação de lojas tematizadas.\nCada um destes componentes podem ser editados, removidos ou adicionados em cada um dos templates, gerando assim uma infinidade de possibilidades para um lojista ou vários.\nEste projeto visa facilitar a edição de um template tanto para um DEV, quanto a edição de um tema (um template customizado) para um cliente final (leigo), através do *Editor Drag&Drop*",
    "Webstore Control Panel": "Este painel não é apenas uma interface e um HUD criado em ReactJS ele também um é uma biblioteca primária para elementos de CTA e Input de informações.\nBiblioteca criada exclusivamente para a Webstore onde cada elemento é editável únicamente ou por grupo.",
    "Crawler Panel": "O Crawler da Webstore tem o propósito de capturar produtos de lojas virtuais pela internet, principalmente em lojas que tenham o dataLayer do google sendo usado para integrar a loja ao Google MarketPlace. O Crawler tem uma interface feita em Electron.js e faz a comunicação com uma API interna que utiliza a biblioteca do Puppeteer para fazer o scrapping (Busca de dados) de todos os produtos da loja em questão, baseando-se no template escolhido.",
    "Business Page": "Página de relatórios e gráficos visuais com base em dados sobre venda.\nO interessante deste projeto é a possibilidade de filtrar os dados visíveis por presets de datas (1 semana atrás, 1 dia atrás, 1 mês atrás etc...) ou escolher um intervalo de tempo customizado.",
    "3D Bin Packing": "Projeto em Node.js utilizado no cálculo de fretes.\nSão definidos compartimentos e itens usados como parâmetros para uma função de visualização 3D. O propósito desta API é selecionar o menor compartimento possível possível para um conjunto de itens, levando em consideração a somatória dos volumes e ângulos possíveis para o conjunto.\nPor exemplo: Uma prancha de comprimento 110cm apesar de ser maior que uma caixa de 100cm caberia nela caso fosse posicionada na diagonal.",
    "RestAPI For Images Donwload and Treat": "API usada para recuperar qualquer tipo de imagem via link, fazer a sua tratativa de várias formas e gerar uma versão final da foto otimizada quanto sua respectiva thumbnail.",
    "Americanas MarketPlace Integration": "Integração de Sistema entre a Webstore e o Marketplace Americanas.",
    "Omie Erp Integration": "Integração de Sistema entre a Webstore e o Erp Omie.",
    "Mercado Livre MarketPlace Integration": "Integração de Sistema entre a Webstore e o Marketplace Mercado Livre.",
    "NetShoes MarketPlace Integration": "Integração de Sistema entre a Webstore e o Marketplace NetShoes.",
    "Carrefour MarketPlace Integration": "Integração de Sistema entre a Webstore e o Marketplace Carrefour.",
    "Dafiti MarketPlace Integration": "Integração de Sistema entre a Webstore e o Marketplace Dafiti.",
    "Magalu MarketPlace Integration": "Integração de Sistema entre a Webstore e o Marketplace Magalu."
  }
}